УТ_для_edt/src/Documents/смартУправлениеАкциями/смартУправлениеАкциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУправлениеАкциями</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <registerRecords>AccumulationRegister.смартОстаткиАкционныхТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныРозница</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкции</name>
    <type>
      <types>EnumRef.смартВидыАкций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаРозница</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаАкция</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеДемозала</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТоваров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусСумма</name>
      <comment>//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартОстаткиАкционныхТоваров/смартОстаткиАкционныхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартОстаткиАкционныхТоваров</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументАкции</name>
    <type>
      <types>DocumentRef.смартУправлениеАкциями</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыАкций/смартСтатусыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>Подготавливается</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
    <comment>//++ #Б-7532 смарт: Фролов 20.07.2026 //Добавить статус &quot;Завершено&quot; в Управление акциями</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыАкций/смартВидыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>Уценка</name>
  </enumValues>
  <enumValues>
    <name>СпецЦена</name>
  </enumValues>
  <enumValues>
    <name>Распродажа</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартУправлениеАкциями/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.смартОстаткиАкционныхТоваров.Записывать = Истина;
	
	Если Статус = Перечисления.смартСтатусыАкций.Действует Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	смартУправлениеАкциямиТовары.Номенклатура КАК Номенклатура,
		|	смартУправлениеАкциямиТовары.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА НЕ смартУправлениеАкциямиТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ смартУправлениеАкциямиТовары.КоличествоТоваров
		|	КОНЕЦ КАК Количество,
		|	смартУправлениеАкциямиТовары.Ссылка КАК ДокументАкции,
		|	смартУправлениеАкциямиТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.смартУправлениеАкциями.Товары КАК смартУправлениеАкциямиТовары
		|ГДЕ
		|	смартУправлениеАкциямиТовары.Ссылка = &Ссылка";
		
		Если НЕ ВидАкции = Перечисления.смартВидыАкций.Распродажа Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И НЕ смартУправлениеАкциямиТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Движения.смартОстаткиАкционныхТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидАкции = Перечисления.смартВидыАкций.ДемоЗал Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.ОборудованиеДемозала");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
